# Объявляем класс (шаблон) Graph, внутри которого будут храниться данные и команды для работы с графом (как устроен объект и что умеет делать)
class Graph:
    # Инициализация, запускается при создании нового графа Graph() и задает его начальные параметры (список self.matrix)),куда загружается таблица смежности
    def init(self):
        # Создаем внутри графа пустой список matrix - сюда запишется таблица смежности
        self.matrix = []

    # Чтение матриц из файла

    # Создаем команду для чтения load_from_file, (self) - в какой граф заполняем матрицу;(filename) - из какого файла читать матрицу
    def load_from_file(self, filename):
        # Очищаем список матрицы, записывая пустой список
        self.matrix = [] 

        # Открываем текстовый файл, читаем данные
        with open(filename, 'r') as file:
            # Берем из файла одну текстовую строчку за другой
            for line in file:
                # Разрезаем строчку по пробелам на отдельные кусочки текста (получаем список символов)
                pieces = line.split() 
                # Создаем пустой список под первую строку (создается из разрезанных кусочков)
                row = [] 
                # Каждый кусочек конвертируем в числовой тип данных из строкового
                for piece in pieces:
                    number = int(piece)   
                    # Добавляем это число в конец строки row
                    row.append(number)    
                # Собранную числовую строку добавляем в общую таблицу графа self.matrix
                self.matrix.append(row)
            #Циклы повторяются, пока весь файл не будет прочитан (не закончатся элементы)

        # Вывод        
        print("Прочитан файл:", filename)

    # Поиск минимального разреза (алгоритм Штёра-Вагнера)

     # Создаем команду для поиска минимального разреза min_cut, которая ссылается на граф, вызывающий функцию(self)
    def min_cut(self):
        # Записываем размер матрицы (количество вершин) в size
        size = len(self.matrix)
        #проверка на возможность разрезать граф (нельзя разрезать при количестве вершин <=1)
        if size <= 1:
            return 0

        # Создаем список имен вершин (чтобы при стягивании вершин объединять их веса)
        # каждая вершина - это отдельная группа [0] [1] [2] и тд.
        vertices = []
        #создаем для каждой вершины её личный список и прикрепляем его в конец общего списка групп
        for i in range(size):
            vertices.append([i])

        # Копируем матрицу, так как алгоритм будет её менять
        # создаем новый список mat
        mat = []
        #цикл по строкам
        for i in range(size):
            #список для записи строки
            row = []
            #цикл по столбцам
            for j in range(size):
                #берем число из матрицы и переносим его в конец списка row с помощью .append()
                row.append(self.matrix[i][j])
            #добавляем row в конец копии mat
            mat.append(row)

        min_cut_value = 999999  #старт с недосягаемо большого числа,с ним сравниваем первый разрез

        #Алгоритм - уменьшаем количество вершин по одной
        for step in range(size - 1): #step - счетчик итераций сжатия графа
            current_size = len(mat) #отслеживание текущего размера графа (сколько вершин осталось)
            
            # Массивы для фазы Сторна-Вагнера
            added = [] #складываем статусы (True/False)
            weights = [] #складываем текущие суммы весов связей для каждой вершины
            for i in range(current_size): #цикл по каждой вершине оставшимя в матрице на текущий момент
                added.append(False) #все обнуляем для каждой вершины на старте
                weights.append(0)
            last = 0 #последняя вершина для проверки разреза
            prev = 0 #предпоследняя

           
            for i in range(current_size):  
                max_w = -1 #сброс максимального веса перед началом поиска
                selected = -1 #сброс индекса выбранной вершины
                
                for j in range(current_size):
                    if added[j] == False and weights[j] > max_w: #ищем свободные вершины с самым большим весом, запоминаем ее индекс и вес
                        max_w = weights[j]
                        selected = j
                prev = last #перед записью новой вершины перекладываем старую назад (помним последние две вершины)
                last = selected
                added[last] = True #записываем отметку для этой вершины, больше ее не выбираем

                # Обновляем веса для оставшихся вершин
                for j in range(current_size):
                    if added[j] == False: #ищем кого еще нет в цепи
                        weights[j] = weights[j] + mat[last][j]
                        #К накопленным раннее связям (weights[j]) прибавляется связь с только что добавленной вершиной (mat[last][j]), обновляя общий вес для оставшихся вершин.

            # переменная для подсчета веса разреза
            cut_value = 0
            for j in range(current_size):
                cut_value = cut_value + mat[last][j]
                #Берем вес связи от последней вершины (last) до текущей вершины (j) и прибавляем его к общей сумме разреза (cut_value)

            # Обновляем минимум, если нашли разрез меньше,cut_value разрез на этом шаге, min_cut_value общий рекорд
            if cut_value < min_cut_value:
                min_cut_value = cut_value

            # Стягиваем две последние вершины (last и prev) в одну
            for j in range(current_size):
                mat[prev][j] = mat[prev][j] + mat[last][j]
                mat[j][prev] = mat[prev][j]

            # Удаляем строку и столбец вершины 'last'
            mat.pop(last)
            for j in range(current_size - 1):
                mat[j].pop(last)

        return min_cut_value


# Создаем граф
graph = Graph()

# Загружаем матрицу из файла
graph.load_from_file('input1.txt')

# Запускаем алгоритм поиска минимального разреза
result = graph.min_cut()

# Выводим ответ
print("\nМинимальный разрез графа равен:", result)
print("\nЗавершено.")
